In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
##drop a column,index...

ser1 = Series(np.arange(3),index=['a','b','c'])

In [3]:
ser1

a    0
b    1
c    2
dtype: int32

In [4]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [5]:
DataFrame1 = DataFrame(np.arange(9).reshape((3,3)),index=['CA','WA','NY'],columns =['pop','size','year'])

In [6]:
DataFrame1

    pop  size  year
CA    0     1     2
WA    3     4     5
NY    6     7     8

In [8]:
DataFrame1.drop('CA')

    pop  size  year
WA    3     4     5
NY    6     7     8

In [9]:
DataFrame1

    pop  size  year
CA    0     1     2
WA    3     4     5
NY    6     7     8

In [10]:
DataFrame2 = DataFrame1.drop('CA')   ##CA row is removed

In [11]:
DataFrame2

    pop  size  year
WA    3     4     5
NY    6     7     8

In [12]:
DataFrame1

    pop  size  year
CA    0     1     2
WA    3     4     5
NY    6     7     8

In [13]:
DataFrame1.drop('year',axis=1)  ##year coulmn is removed

    pop  size
CA    0     1
WA    3     4
NY    6     7

In [15]:
##selecting entries

ser1 = Series(np.arange(3),index=['A','B','C'])

#

In [16]:
ser1

A    0
B    1
C    2
dtype: int32

In [17]:
ser1 = 2*ser1

In [18]:
ser1

A    0
B    2
C    4
dtype: int32

In [19]:
ser1['B']

2

In [20]:
ser1[1]

2

In [21]:
ser1[0]

0

In [22]:
ser1[2]

4

In [23]:
ser1['A']

0

In [24]:
ser1['C']

4

In [25]:
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [26]:
ser1[['A','B']]

A    0
B    2
dtype: int32

In [27]:
ser1[ser1>3]

C    4
dtype: int32

In [28]:
ser1[ser1>3] =10

In [29]:
ser1

A     0
B     2
C    10
dtype: int32

In [34]:
DataFrame = DataFrame(np.arange(25).reshape((5,5)),index=['CA','WA','NY','CHI','DC'],columns =['p','s','i','z','e'])

In [35]:
DataFrame

      p   s   i   z   e
CA    0   1   2   3   4
WA    5   6   7   8   9
NY   10  11  12  13  14
CHI  15  16  17  18  19
DC   20  21  22  23  24

In [36]:
DataFrame['p'] #details of p column

CA      0
WA      5
NY     10
CHI    15
DC     20
Name: p, dtype: int32

In [37]:
DataFrame[['p','i']]

      p   i
CA    0   2
WA    5   7
NY   10  12
CHI  15  17
DC   20  22

In [38]:
DataFrame[DataFrame['i']>8]   ##as firt 2 rows are less than 8 u will not able to see the rows

      p   s   i   z   e
NY   10  11  12  13  14
CHI  15  16  17  18  19
DC   20  21  22  23  24

In [39]:
DataFrame

      p   s   i   z   e
CA    0   1   2   3   4
WA    5   6   7   8   9
NY   10  11  12  13  14
CHI  15  16  17  18  19
DC   20  21  22  23  24

In [40]:
##boolean


DataFrame>10

         p      s      i      z      e
CA   False  False  False  False  False
WA   False  False  False  False  False
NY   False   True   True   True   True
CHI   True   True   True   True   True
DC    True   True   True   True   True

In [47]:
DataFrame.index[1]

'WA'

In [51]:
##data alignment


ser1 = Series([0,1,2,3,4],index=['A','B','C','D','E'])

In [52]:
ser1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [53]:
ser2 = Series([3,4,5],index=['A','B','C'])

In [54]:
ser2

A    3
B    4
C    5
dtype: int64

In [55]:
ser1 + ser2  ##whatever is matchws it got added up and the rest with null values automatically

A    3.0
B    5.0
C    7.0
D    NaN
E    NaN
dtype: float64

In [63]:
##rank and sort

ser1 =Series(range(3),index=['c','a','b'])

In [64]:
ser1

c    0
a    1
b    2
dtype: int64

In [65]:
##sorting

ser1.sort_index()

a    1
b    2
c    0
dtype: int64

In [67]:
from numpy.random import randn

In [68]:
ser2 = Series(randn(10))

In [69]:
ser2

0    0.123196
1   -1.939602
2    0.759316
3    0.200189
4    0.056683
5    0.464861
6   -0.203814
7   -1.125392
8   -0.803907
9   -0.607013
dtype: float64

In [74]:
ser2.rank()

0     7.0
1     1.0
2    10.0
3     8.0
4     6.0
5     9.0
6     5.0
7     2.0
8     3.0
9     4.0
dtype: float64

In [75]:
ser1.rank()

c    1.0
a    2.0
b    3.0
dtype: float64